apache/nuttx/arch/xtensa/src/esp32/esp32_i2c.c
              priv->i2cstate = I2CSTATE_IDLE;
              ret = OK;
            }
        }
#else
      ret = esp32_i2c_polling_waitdone(priv);
      if (ret < 0)
        {
          if (ret == -ETIMEDOUT)
            {
              break;
            }
          else
            {
              ret = -EIO;
              break;
            }
        }
      else
        {
          /* Successful transfer, update the I2C state to idle */

          priv->i2cstate = I2CSTATE_IDLE;
          ret = OK;
        }
#endif
    }

  /* Dump the trace result */

  esp32_i2c_tracedump(priv);

  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: esp32_i2c_clear_bus
 *
 * Description:
 *   Clear I2C bus, when the slave is stuck in a deadlock and keeps pulling
 *   the bus low, master can control the SCL bus to generate 9 CLKs.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_RESET
static int esp32_i2c_clear_bus(struct esp32_i2c_priv_s *priv)
{
  uint32_t clock_count;
  uint32_t stretch_count;
  int ret;
  const struct esp32_i2c_config_s *config = priv->config;

  /* Use GPIO configuration to un-wedge the bus */

  esp_configgpio(config->scl_pin, INPUT_PULLUP | OUTPUT_OPEN_DRAIN);
  esp_gpio_matrix_out(config->scl_pin, SIG_GPIO_OUT_IDX, 0, 0);
  esp_configgpio(config->sda_pin, INPUT_PULLUP | OUTPUT_OPEN_DRAIN);
  esp_gpio_matrix_out(config->sda_pin, SIG_GPIO_OUT_IDX, 0, 0);

  /* Set SDA to high */

  esp_gpiowrite(config->sda_pin, 1);

  /* Clock the bus until any slaves currently driving it let it go. */

  clock_count = 0;
  while (!esp_gpioread(config->sda_pin))
    {
      /* Give up if we have tried too hard */

      if (clock_count++ >= I2C_SCL_CYC_NUM_DEF)
        {
          ret = -EIO;
          goto out;
        }

      /* Sniff to make sure that clock stretching has finished.
       *
       * If the bus never relaxes, the reset has failed.
       */

      stretch_count = 0;
      while (!esp_gpioread(config->scl_pin))
        {
          /* Give up if we have tried too hard */

          if (stretch_count++ > 10)
            {
              ret = -EIO;
              goto out;
            }

          up_udelay(10);
        }

      /* Drive SCL low */

      esp_gpiowrite(config->scl_pin, 0);
      up_udelay(10);

      /* Drive SCL high again */

      esp_gpiowrite(config->scl_pin, 1);
      up_udelay(10);
    }

  /* Generate a start followed by a stop to reset slave
   * state machines.
   */

  esp_gpiowrite(config->sda_pin, 0);
  up_udelay(10);
  esp_gpiowrite(config->scl_pin, 0);
  up_udelay(10);
  esp_gpiowrite(config->scl_pin, 1);
  up_udelay(10);
  esp_gpiowrite(config->sda_pin, 1);
  up_udelay(10);

  ret = OK;

out:
  return ret;
}
#endif

/****************************************************************************
 * Name: esp32_i2c_reset
 *
 * Description:
 *   Perform an I2C bus reset in an attempt to break loose stuck I2C devices.
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure.
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_RESET
static int esp32_i2c_reset(struct i2c_master_s *dev)
{
  struct esp32_i2c_priv_s *priv = (struct esp32_i2c_priv_s *)dev;

  DEBUGASSERT(dev);
  DEBUGASSERT(priv->refs > 0);

  nxmutex_lock(&priv->lock);

  esp32_i2c_deinit(priv);
  esp32_i2c_clear_bus(priv);
  esp32_i2c_init(priv);

  priv->i2cstate = I2CSTATE_IDLE;
  priv->msgid = 0;
  priv->bytes = 0;
  priv->ready_read = 0;

  nxmutex_unlock(&priv->lock);
  return OK;
}
#endif

/****************************************************************************
 * Name: esp32_i2c_traceclear
 *
 * Description:
 *   Set I2C trace fields to default value.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_TRACE
static void esp32_i2c_traceclear(struct esp32_i2c_priv_s *priv)
{
  struct esp32_trace_s *trace = &priv->trace[priv->tndx];

  trace->status = 0;
  trace->count  = 0;
  trace->event  = I2CEVENT_NONE;
  trace->parm   = 0;
  trace->time   = 0;
}
#endif /* CONFIG_I2C_TRACE */

/****************************************************************************
 * Name: esp32_i2c_tracereset
 *
 * Description:
 *   Reset the trace info for a new data collection.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_TRACE
static void esp32_i2c_tracereset(struct esp32_i2c_priv_s *priv)
{
  priv->tndx       = 0;
  priv->start_time = clock_systime_ticks();
  esp32_i2c_traceclear(priv);
}
#endif /* CONFIG_I2C_TRACE */

/****************************************************************************
 * Name: esp32_i2c_tracenew
 *
 * Description:
 *   Create a new trace entry.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *   status        - Current value of I2C status register.
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_TRACE
static void esp32_i2c_tracenew(struct esp32_i2c_priv_s *priv,
                               uint32_t status)
{
  struct esp32_trace_s *trace = &priv->trace[priv->tndx];

  /* Check if the current entry is already initialized or if its status had
   * already changed
   */

  if (trace->count == 0 || status != trace->status)
    {
      /* Check whether the status changed  */

      if (trace->count != 0)
        {
          /* Bump up the trace index (unless we are out of trace entries) */

          if (priv->tndx >= (CONFIG_I2C_NTRACE - 1))
            {
              i2cerr("ERROR: Trace table overflow\n");
              return;
            }

