apache/nuttx/arch/xtensa/src/esp32/esp32_i2c.c
          priv->tndx++;
          trace = &priv->trace[priv->tndx];
        }

      /* Initialize the new trace entry */

      esp32_i2c_traceclear(priv);
      trace->status = status;
      trace->count  = 1;
      trace->time   = clock_systime_ticks();
    }
  else
    {
      /* Just increment the count of times that we have seen this status */

      trace->count++;
    }
}
#endif /* CONFIG_I2C_TRACE */

/****************************************************************************
 * Name: esp32_i2c_traceevent
 *
 * Description:
 *   Record a new trace event.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *   event         - Event to be recorded on the trace.
 *   parm          - Parameter associated with the event.
 *   status        - Current value of I2C status register.
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_TRACE
static void esp32_i2c_traceevent(struct esp32_i2c_priv_s *priv,
                                 enum esp32_trace_e event,
                                 uint32_t parm,
                                 uint32_t status)
{
  /* Check for new trace setup */

  esp32_i2c_tracenew(priv, status);

  if (event != I2CEVENT_NONE)
    {
      struct esp32_trace_s *trace = &priv->trace[priv->tndx];

      /* Initialize the new trace entry */

      trace->event = event;
      trace->parm  = parm;

      /* Bump up the trace index (unless we are out of trace entries) */

      if (priv->tndx >= (CONFIG_I2C_NTRACE - 1))
        {
          i2cerr("ERROR: Trace table overflow\n");
          return;
        }

      priv->tndx++;
      esp32_i2c_traceclear(priv);
    }
}
#endif /* CONFIG_I2C_TRACE */

/****************************************************************************
 * Name: esp32_i2c_tracedump
 *
 * Description:
 *   Dump the trace results.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_TRACE
static void esp32_i2c_tracedump(struct esp32_i2c_priv_s *priv)
{
  struct esp32_trace_s *trace;
  int i;

  syslog(LOG_DEBUG, "Elapsed time: %" PRId64 "\n",
         (clock_systime_ticks() - priv->start_time));

  for (i = 0; i < priv->tndx; i++)
    {
      trace = &priv->trace[i];
      syslog(LOG_DEBUG,
             "%2d. STATUS: %08" PRIx32 " COUNT: %3" PRIu32 " EVENT: %s(%2d)"
             " PARM: %08" PRIx32 " TIME: %" PRId64 "\n",
             i + 1, trace->status, trace->count, g_trace_names[trace->event],
             trace->event, trace->parm, trace->time - priv->start_time);
    }
}
#endif /* CONFIG_I2C_TRACE */

/****************************************************************************
 * Name: esp32_i2c_irq
 *
 * Description:
 *   This is the common I2C interrupt handler.  It will be invoked
 *   when an interrupt received on the device.
 *
 ****************************************************************************/

#ifndef CONFIG_I2C_POLLED
static int esp32_i2c_irq(int cpuint, void *context, void *arg)
{
  struct esp32_i2c_priv_s *priv = (struct esp32_i2c_priv_s *)arg;

  /* Get the interrupt status and clear the interrupts that
   * triggered.
   */

  uint32_t status = esp32_i2c_get_reg(priv, I2C_INT_STATUS_OFFSET);
  esp32_i2c_set_reg(priv, I2C_INT_CLR_OFFSET, status);
  esp32_i2c_process(priv, status);
  return OK;
}
#endif

/****************************************************************************
 * Name: esp32_i2c_process
 *
 * Description:
 *   This routine manages the transfer. It's called after some specific
 *   commands from the I2C controller are executed or in case of errors.
 *   It's responsible for writing/reading operations and transferring data
 *   from/to FIFO.
 *   It's called in the interrupt and polled driven mode.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *   status        - The current interrupt status register.
 *
 ****************************************************************************/

static inline void esp32_i2c_process(struct esp32_i2c_priv_s *priv,
                                     uint32_t status)
{
  struct i2c_msg_s *msg = &priv->msgv[priv->msgid];

  /* Check for any errors */

  if (I2C_INT_ERR_EN_BITS & status)
    {
      /* Save the errors, register the error event, disable interrupts
       * and release the semaphore to conclude the transfer.
       */

      priv->error = status & I2C_INT_ERR_EN_BITS;
      esp32_i2c_traceevent(priv, I2CEVENT_ERROR, priv->error,
                           esp32_i2c_get_reg(priv, I2C_SR_OFFSET));
      esp32_i2c_set_reg(priv, I2C_INT_ENA_OFFSET, 0);
#ifndef CONFIG_I2C_POLLED
      nxsem_post(&priv->sem_isr);
#endif
    }
  else /* If no error */
    {
      /* If a transfer has just initialized */

      if (priv->i2cstate == I2CSTATE_PROC)
        {
          /* Check the flags to perform a read or write operation */

          if (msg->flags & I2C_M_READ)
            {
              /* RX FIFO has available data */

              if (priv->ready_read)
                {
                  esp32_i2c_traceevent(priv, I2CEVENT_RCVBYTE, priv->bytes,
                                     esp32_i2c_get_reg(priv, I2C_SR_OFFSET));
                  esp32_i2c_recvdata(priv);

                  priv->ready_read = 0;
                }

              /* Received all data. Finish the transaction
               * and update the state I2C state.
               */

              if (priv->bytes == msg->length)
                {
                  esp32_i2c_traceevent(priv, I2CEVENT_STOP, msg->length,
                                     esp32_i2c_get_reg(priv, I2C_SR_OFFSET));
                  esp32_i2c_sendstop(priv);
#ifndef CONFIG_I2C_POLLED
                  priv->i2cstate = I2CSTATE_FINISH;
#endif
                }
              else /* Start a receive operation */
                {
                  esp32_i2c_traceevent(priv, I2CEVENT_RCVMODEEN, 0,
                                     esp32_i2c_get_reg(priv, I2C_SR_OFFSET));
                  esp32_i2c_startrecv(priv);

                  priv->ready_read = 1;
                }
            }
          else /* Write operation */
            {
              esp32_i2c_traceevent(priv, I2CEVENT_SENDBYTE, priv->bytes,
                                   esp32_i2c_get_reg(priv, I2C_SR_OFFSET));
              esp32_i2c_senddata(priv);

              /* Finally sent the entire message. Update the I2C state to
               * send a stop signal in the next interrupt.
               */

              if (priv->bytes == msg->length)
                {
                  if ((msg->flags & I2C_M_NOSTOP) == 0)
                    {
                      priv->i2cstate = I2CSTATE_STOP;
                    }
#ifndef CONFIG_I2C_POLLED
                  else
                    {
                      priv->i2cstate = I2CSTATE_FINISH;
                    }
#endif
                }
            }
        }
      else if (priv->i2cstate == I2CSTATE_STOP)
        {
          /* Transmitted all data. Finish the transaction sending a stop
           * and update the state I2C state.
           */

          esp32_i2c_traceevent(priv, I2CEVENT_STOP, msg->length,
                               esp32_i2c_get_reg(priv, I2C_SR_OFFSET));
          esp32_i2c_sendstop(priv);
#ifndef CONFIG_I2C_POLLED
          priv->i2cstate = I2CSTATE_FINISH;
#endif
        }
#ifndef CONFIG_I2C_POLLED
      else if (priv->i2cstate == I2CSTATE_FINISH)
        {
          /* Disable all interrupts and release the semaphore */

          esp32_i2c_set_reg(priv, I2C_INT_ENA_OFFSET, 0);
          nxsem_post(&priv->sem_isr);
        }
#endif
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32_i2cbus_initialize
 *
 * Description:
 *   Initialize one I2C bus
 *
 ****************************************************************************/

struct i2c_master_s *esp32_i2cbus_initialize(int port)
{
  struct esp32_i2c_priv_s *priv;
#ifndef CONFIG_I2C_POLLED
  const struct esp32_i2c_config_s *config;
  int ret;
#endif

  switch (port)
    {
#ifdef CONFIG_ESP32_I2C0
    case 0:
      priv = &esp32_i2c0_priv;
      break;
#endif
#ifdef CONFIG_ESP32_I2C1
    case 1:
      priv = &esp32_i2c1_priv;
      break;
#endif
    default:
      return NULL;
    }

  nxmutex_lock(&priv->lock);
  if (priv->refs++ != 0)
    {
      nxmutex_unlock(&priv->lock);
      return (struct i2c_master_s *)priv;
    }

#ifndef CONFIG_I2C_POLLED
  config = priv->config;

  /* Set up to receive peripheral interrupts on the current CPU */

  priv->cpu = this_cpu();
  priv->cpuint = esp_setup_irq(config->periph,
                               1,
                               ESP_IRQ_TRIGGER_LEVEL,
                               esp32_i2c_irq,
                               priv);
  if (priv->cpuint < 0)
    {
      /* Failed to allocate a CPU interrupt of this type */

      priv->refs--;
      nxmutex_unlock(&priv->lock);

      return NULL;
    }

  up_enable_irq(config->irq);
#endif

  esp32_i2c_init(priv);
  nxmutex_unlock(&priv->lock);

  return (struct i2c_master_s *)priv;
}

/****************************************************************************
 * Name: esp32_i2cbus_uninitialize
 *
 * Description:
 *   Uninitialize an I2C bus
 *
 ****************************************************************************/

int esp32_i2cbus_uninitialize(struct i2c_master_s *dev)
{
  struct esp32_i2c_priv_s *priv = (struct esp32_i2c_priv_s *)dev;

  DEBUGASSERT(dev);

  if (priv->refs == 0)
    {
      return ERROR;
    }

  nxmutex_lock(&priv->lock);
  if (--priv->refs)
    {
      nxmutex_unlock(&priv->lock);
      return OK;
    }

#ifndef CONFIG_I2C_POLLED
  up_disable_irq(priv->config->irq);
  esp_teardown_irq(priv->config->periph, priv->cpuint);
#endif

  esp32_i2c_deinit(priv);
  nxmutex_unlock(&priv->lock);

  return OK;
}

#endif /* CONFIG_ESPRESSIF_I2C_PERIPH_MASTER_MODE */
